[
    {
        "index": 1,
        "imageSource": "/assets/images/people/Frances_Cathryn.jpg",
        "imageAltText": "Frances Cathryn",
        "name": "Frances Cathryn",
        "title": "Board Director",
        "board_director": true,
        "staff": false,
        "bio": "Frances Cathryn is an editor, arts educator and community organizer who collaborates with others to shift how we define what it means to create valuable work in the world.  Over the years, she formed relationships with arts organizers and social-justice activists who struggle to do anti-oppression work in museums and traditional nonprofits, and learned how grassroots community-building can lead to change in institutions large and small.  She developed a social practice that focuses on institutional divestment and anti-oppression in the arts, and collaborates with community spaces, organizations, museums and others in the industry to build temporary gatherings where folks learn how to turn individual resources into collective action.  Through wip projects, Frances helps organizations dismantle systems of bias that exclude the voices of marginalized folks from the cultural conversation around art making.",
        "email": null,
        "urlAddress": [ "https://francescathryn.com/" ]
    },
    {
        "index": 2,
        "imageSource": "/assets/images/people/Oreen_Cohen_profile.jpg",
        "imageAltText": "Oreen Cohen",
        "name": "Oreen Cohen",
        "title": "Board Director",
        "board_director": true,
        "staff": false,
        "bio": "Oreen Cohen grew up between the Rust Belt of the United States and Israel, currently living and working in Pittsburgh, Pennsylvania.  She received a Master of Fine Arts degree in Sculpture in 2014 from Carnegie Mellon University and a Bachelor of Fine Arts in Painting with a minor in Art History at the University at Buffalo.  She has been active over the past sixteen years participating in exhibitions, residencies and public commissions nationally and internationally.  Most recently, she was invited to create site-specific works for projects like: “When Artists Enter the Factory” at the Brooklyn Army Terminal. FIGMENT Sculpture Project (Governors Island, NYC); Flint Public Art Project (Flint, MI); CerCCa Casamarles Residency in Catalonia, Spain as well as participated in the class of 2013 at Skowhegan School of Painting and Sculpture.  She is co-owner a public art design company, OOA Designs LLC, which is currently working with the Pittsburgh Department of City Planning for a permanent public artwork to be installed in Wightman Park, Squirrel Hill in Pittsburgh in April of 2020.  Her interdisciplinary art practice spans the potentiality of material, body and space in sculpture, painting, drawing, public art, intervention and video performance.",
        "email": null,
        "urlAddress": [ "https://www.oreencohen.com/" ]
    },
    {
        "index": 3,
        "imageSource": "/assets/images/people/stephen_dewyer_profile.jpg",
        "imageAltText": "stephen dewyer",
        "name": "stephen dewyer",
        "title": "Founder, UX Designer, Full-stack Web Developer and Board Director",
        "board_director": true,
        "staff": true,
        "bio": "stephen dewyer is Founder of public arts commission, an artist, full-stack web developer, UX designer and Founding Director of Art in Tech Services Inc, a company that works to create groundbreaking digital products that improve human experiences of technology.  He helped organize a number of local and national campaigns and movements for economic justice.<br /><br />  From 2013-2017, stephen served as Co-Founding Editor of ∞ mile (Infinite Mile LLC), a journal of art and cultures in Detroit that published monthly online issues and annual print anthologies.<br /><br />stephen’s works have shown in national and international exhibitions. He makes environmentally-responsive installations as a part of performances, frequently using digital media.<br /><br />In 2009, he curated the exhibition `Propositions` at Area 405 in Baltimore, Maryland.<br /><br />stephen earned an M.F.A. in Sculpture from the Yale University School of Art in 2011 and a B.F.A. in Art History, Theory & Criticism from the Maryland Institute College of Art (MICA) in 2008.",
        "email": "sdewyer@publicartscommission.org",
        "urlAddress": [ "https://stephengdewyer.info/", "https://artintechservices.com/", "https://stephendewyerwebwork.com" ]
    },
    {
        "index": 4,
        "imageSource": "/assets/images/people/Miles_Huston_profile.jpg",
        "imageAltText": "Miles Huston",
        "name": "Miles Huston",
        "title": "Board Director",
        "board_director": true,
        "staff": false,
        "bio": "Miles Huston is an Artist, Designer, Curator, and Writer. He received his MFA from Yale in 2010. He is represented by Gordon Robichaux Gallery. He is a member of the architecture collective CityGroup and the Gyorgy Kepes Panel Committee. He is an interior designer for the perfumer Frederic Malle. He was the co-founder of the artist run space KnowMoreGames. He is a contributing writer to F magazine where he explores the relationship between the history of Agriculture, Technology and Art. His new book `Demonstration; A brief history of the word` will be published in 2021 by F press. His most recent project is Communipaw Farm, a food hub pavilion in Jersey City, New Jersey where he lives and works.",
        "email": null,
        "urlAddress": [ "https://gordonrobichaux.com/artists/huston-miles" ]
    },
    {
        "index": 5,
        "imageSource": "/assets/images/people/Tatyana_Kurepina.jpg",
        "imageAltText": "Tatyana Kurepina",
        "name": "Tatyana Kurepina",
        "title": "Board Director",
        "board_director": true,
        "staff": false,
        "bio": "Tatyana Kurepina is an artist, a documentarian and a passionate advocate for the arts, believing strongly in the power of supporting and empowering local artists through visual storytelling, collaboration and community building.<br /><br />From 2017 - 2020, Tatyana co-owned a creative marketing agency in Miami, Florida that catered to small business owners. Her speciality was brand strategy, design, and social media marketing. In the summer of 2020 she relocated to Rochester, Minnesota where she has been documenting art created during the pandemic through in-depth, on camera interviews with local artists. She also serves as Program Manager for Threshold Arts, and works closely with the Rochester Art Center and the Rochester International Film Group.<br /><br />Her most recent project was a short documentary about Ethan Mundt, also known as Utica Queen, commissioned by the Rochester Art Center.<br /><br />Tatyana earned her B.A. in Visual Media Arts Production from Emerson College in 2018 and interned with The Chicago Tribune, Brella Productions, Ingredients for Education, The Borscht Corporation and The World Channel for WGBH-PBS.",
        "email": null,
        "urlAddress": [ "https://www.filmsaboutartists.com/" ]
    },
    {
        "index": 6,
        "imageSource": "/assets/images/people/Key_Jo_Lee_profile_image_square.jpg",
        "imageAltText": "Key Jo Lee",
        "name": "Key Jo Lee",
        "title": "Board Director",
        "board_director": true,
        "staff": false,
        "bio": "Key Jo Lee is an art historian, curator, critic and the Assistant Director of Academic Affairs at the Cleveland Museum of Art. In her role at the museum, she designs and implements programs designed to inspire scholarly engagements with the CMA’s collections, creates and tracks opportunities for exposure to humanities fields and museum careers for undergraduate and graduate students, and develops and oversees the CMA’s academic partnerships. Currently, she is completing a dissertation entitled, “Melancholic Materiality: History and the Unhealable Wound in Photographic Portraits of African Americans, 1850-1877 in the history of art and African American studies departments at Yale University. She is deeply invested in scholar and artist activism as means of creative and intellectual expression.",
        "email": null,
        "urlAddress": null
    },
    {
        "index": 7,
        "imageSource": "/assets/images/people/Clynton_Lowry_profile.jpg",
        "imageAltText": "Clynton Lowry",
        "name": "Clynton Lowry",
        "title": "Board Director",
        "board_director": true,
        "staff": false,
        "bio": "Clynton Lowry is an artist and a writer, as well as the founder and editor-in-chief of Art Handler magazine, and founder of jobs.art. Lowry received his MFA in Painting from Yale School of Art, and his BA in English from UC Berkeley.",
        "email": null,
        "urlAddress": [ "http://art-handler.com/", "https://www.jobs.art/" ]
    }
]